<a href="https://colab.research.google.com/github/DEEPTHIA29/Code/blob/master/PANDAS_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
s=pd.Series(['Eshanth Das','Data Science','Scientist','Hello World','Machine Learning'])

UPPER AND LOWER FUNCTION

In [3]:
s.str.upper()

0         ESHANTH DAS
1        DATA SCIENCE
2           SCIENTIST
3         HELLO WORLD
4    MACHINE LEARNING
dtype: object

In [4]:
s.str.lower()

0         eshanth das
1        data science
2           scientist
3         hello world
4    machine learning
dtype: object

LENGTH FUNCTION

In [5]:
for i in s:
  print(len(i))

11
12
9
11
16

STRIP FUNCTION

In [ ]:
s=s.str.strip() #strip function remove the spaces
for i in s:
  print(i)

SPLIT FUNCTION

In [12]:
s.str.split() #to split the owrds

0         [Eshanth, Das]
1        [Data, Science]
2            [Scientist]
3         [Hello, World]
4    [Machine, Learning]
dtype: object

CONTAINS FUNTION

In [13]:
s.str.contains('s') #to check particular word or letter is present or not

0     True
1    False
2     True
3    False
4    False
dtype: bool

REPLACE FUNCTION

In [14]:
s.str.replace('s','a')

0         Eahanth Daa
1        Data Science
2           Scientiat
3         Hello World
4    Machine Learning
dtype: object

COUNT FUNCTION

In [15]:
s.str.count('a') #count how many times the word/letter appears

0    2
1    2
2    0
3    0
4    2
dtype: int64

In [ ]:
STARTS WITH AND ENDSWITH

In [16]:
s.str.endswith('a')

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [21]:
s.str.startswith('S')

0    False
1    False
2     True
3    False
4    False
dtype: bool

FIND FUNCTION

In [22]:
s.str.find('Data')

0   -1
1    0
2   -1
3   -1
4   -1
dtype: int64

CONVERTING A SERIES INTO LIST

In [24]:
s.to_list()

['Eshanth Das', 'Data Science', 'Scientist', 'Hello World', 'Machine Learning']